In [3]:
d = {
    "name": ["Sarthak", "Uday", "Sayali"],
    "age": [27, 32, 30],
    "occupation": ["Accounts", "Manager", "Engg"],
    "email": ["s@test.com", "u@test.com", "p@test.com"]
}
print(d)

{'name': ['Sarthak', 'Uday', 'Sayali'], 'age': [27, 32, 30], 'occupation': ['Accounts', 'Manager', 'Engg'], 'email': ['s@test.com', 'u@test.com', 'p@test.com']}

In [4]:
import pandas as pd
e = pd.DataFrame(d)
e

      name  age occupation       email
0  Sarthak   27   Accounts  s@test.com
1     Uday   32    Manager  u@test.com
2   Sayali   30       Engg  p@test.com

In [5]:
e.shape

(3, 4)

In [6]:
e.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        3 non-null      object
 1   age         3 non-null      int64
 2   occupation  3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 228.0+ bytes

In [7]:
e.size

12

In [8]:
e.dtypes

name          object
age            int64
occupation    object
email         object
dtype: object

In [9]:
e.nunique()

name          3
age           3
occupation    3
email         3
dtype: int64

In [10]:
e.sort_values("age", ascending=False)

      name  age occupation       email
1     Uday   32    Manager  u@test.com
2   Sayali   30       Engg  p@test.com
0  Sarthak   27   Accounts  s@test.com

In [11]:
class Person:
    def __init__(self, name: str, age: int, gender: str, occupation: str):
        self.name = name
        self.age = age
        self.gender = gender
        self.occupation = occupation

    def intro(self):
        print(f"My name is {self.name}")
        print(f"I am {self.age} years old")
        print(f"I am {self.gender}")
        print(f"I work as {self.occupation}")

In [12]:
p1 = Person(name= "Uday", age= 30, gender= "Male", occupation= "Manager")
print(type(p1))

<class '__main__.Person'>

In [13]:
p1.name

'Uday'

In [14]:
p1.age

30

In [15]:
p1.occupation

'Manager'

In [16]:
p1.intro()

My name is Uday
I am 30 years old
I am Male
I work as Manager

In [17]:
p2 = Person(name= "Sayali", age= 29, gender= "Female", occupation= "Engg")
p2.intro()

My name is Sayali
I am 29 years old
I am Female
I work as Engg

In [18]:
persons = (
    Person(name= "Uday", age= 29, gender= "Male", occupation= "Manager"),
    Person(name= "Sayali", age= 27, gender= "Female", occupation= "HR"),
    Person(name= "Yogesh", age= 30, gender= "Male", occupation= "Engg")
)

In [19]:
for p in persons:
    p.intro()
    print("="*20)

My name is Uday
I am 29 years old
I am Male
I work as Manager
====================
My name is Sayali
I am 27 years old
I am Female
I work as HR
====================
My name is Yogesh
I am 30 years old
I am Male
I work as Engg
====================

In [20]:
class Person2:
    def __init__(self, name: str, age: int, gender: str, occupation: str):
        self.name = name
        self.age = age
        self.gender = gender
        self.occupation = occupation

    def __str__(self):
        return f"Person2(name = {self.name}, age = {self.age}, gender = {self.gender}, occupation = {self.occupation})"

    def talk(self):
        print(f"My name is {self.name}")
        print(f"My age is {self.age}")
        print(f"I am {self.gender}")
        print(f"I work as {self.occupation}")

In [21]:
p1 = Person2(name= "Uday", age = 29, gender = "Male", occupation = "Manager")
print(p1)

Person2(name = Uday, age = 29, gender = Male, occupation = Manager)

In [22]:
p1.talk()

My name is Uday
My age is 29
I am Male
I work as Manager

In [35]:
from dataclasses import dataclass
from typing import Literal

@dataclass
class Student:
    roll_no: int
    name: str
    age: int
    gender: Literal["male", "female"]

    def get_info(self):
        print(f"Roll No: {self.roll_no}")
        print(f"Name: {self.name}")
        print(f"Age: {self.age}")
        print(f"Gender: {self.gender}")

In [36]:
s1 = Student(roll_no=102, name="uday", age=29, gender= "male")
print(s1)

Student(roll_no=102, name='uday', age=29, gender='male')

In [37]:
s1.get_info()

Roll No: 102
Name: uday
Age: 29
Gender: male

# Bank Account Class

In [53]:
class Accounts:
    def __init__(self, acc_no: int, name: str, balance: float):
        self.acc_no = acc_no
        self.name = name
        self.balance = balance
        if self.balance < 0:
            raise ValueError("Balance cannot be negative")
        
    def deposit(self, amount: float):
        self.balance = self.balance + amount

    def withdraw(self, amount: float):
        if self.balance <= amount:
            raise ValueError("Insufficient balance")
        else:
            self.balance = self.balance - amount

    def transfer(self, amount: float, ac2: 'Account'):
        self.withdraw(amount)
        ac2.deposit(amount)

In [54]:
amt = Accounts(acc_no= 12345, name= "Uday", balance= 20000)
print(amt)

<__main__.Accounts object at 0x000001FC7FC92E40>

In [55]:
amt.deposit(1000)

In [56]:
amt

In [57]:
amt.balance

21000

In [58]:
amt.withdraw(3000)

In [59]:
amt.balance

18000

In [60]:
amt.transfer(2000)

TypeError: Accounts.transfer() missing 1 required positional argument: 'ac2'

In [61]:
amt.balance

18000

In [62]:
amt2 = Accounts(acc_no=12346, name= "Sayali", balance= 15000)
print(amt2)

<__main__.Accounts object at 0x000001FC00305810>

In [63]:
amt.transfer(1000, amt2)

In [64]:
amt.balance

17000

In [65]:
amt2.balance

16000

In [66]:
print(f"Account Number: {amt.acc_no}, Account Balance: {amt.balance}")
print(f"Account Number: {amt2.acc_no}, Account Balance: {amt2.balance}")
amt2.transfer(3000, amt)
print(f"Account Number: {amt.acc_no}, Account Balance: {amt.balance}")
print(f"Account Number: {amt2.acc_no}, Account Balance: {amt2.balance}")

Account Number: 12345, Account Balance: 17000
Account Number: 12346, Account Balance: 16000
Account Number: 12345, Account Balance: 20000
Account Number: 12346, Account Balance: 13000